; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-5)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
    b8 - block
  )

  (:init
    (ontable b1)
    (on b4 b1)
    (ontable b5)
    (on b2 b5)
    (ontable b3)
    (on b7 b3)
    (ontable b6)
    (ontable b8)
    (clear b4)
    (clear b2)
    (clear b7)
    (clear b6)
    (clear b8)
    (handempty)
  )

  (:goal (and
    (ontable b2)
    (on b5 b2)
    (on b6 b5)
    (on b1 b6)
    (ontable b3)
    (on b8 b3)
    (on b7 b8)
    (on b4 b7)
  ))
)

; plan
1. (unstack b2 b5)
   deleted: (clear b2) (handempty) (on b2 b5)
   added: (holding b2) (clear b5)
   goals met: 1 of 8
2. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 2 of 8
3. (pick-up b5)
   deleted: (ontable b5) (clear b5) (handempty)
   added: (holding b5)
   goals met: 2 of 8
4. (stack b5 b2)
   deleted: (holding b5) (clear b2)
   added: (clear b5) (handempty) (on b5 b2)
   goals met: 3 of 8
5. (pick-up b6)
   deleted: (ontable b6) (clear b6) (handempty)
   added: (holding b6)
   goals met: 3 of 8
6. (stack b6 b5)
   deleted: (holding b6) (clear b5)
   added: (clear b6) (handempty) (on b6 b5)
   goals met: 4 of 8
7. (unstack b7 b3)
   deleted: (clear b7) (handempty) (on b7 b3)
   added: (holding b7) (clear b3)
   goals met: 4 of 8
8. (stack b7 b6)
   deleted: (holding b7) (clear b6)
   added: (clear b7) (handempty) (on b7 b6)
   goals met: 4 of 8
9. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 4 of 8
10. (stack b8 b3)
   deleted: (holding b8) (clear b3)
   added: (clear b8) (handempty) (on b8 b3)
   goals met: 5 of 8
11. (unstack b7 b6)
   deleted: (clear b7) (handempty) (on b7 b6)
   added: (holding b7) (clear b6)
   goals met: 5 of 8
12. (stack b7 b8)
   deleted: (holding b7) (clear b8)
   added: (clear b7) (handempty) (on b7 b8)
   goals met: 6 of 8
13. (unstack b4 b1)
   deleted: (clear b4) (handempty) (on b4 b1)
   added: (holding b4) (clear b1)
   goals met: 6 of 8
14. (stack b4 b7)
   deleted: (holding b4) (clear b7)
   added: (clear b4) (handempty) (on b4 b7)
   goals met: 7 of 8
15. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 7 of 8
16. (stack b1 b6)
   deleted: (holding b1) (clear b6)
   added: (clear b1) (handempty) (on b1 b6)
   goals met: 8 of 8
